<template>
  <a-layout class="layout admin-layout">
    <main-header />
    <a-layout-content style="text-align: left; padding: 1% 2%">
      <v-md-editor
        v-if="active === 'about'"
        v-model="aboutUs"
        mode="preview"
      ></v-md-editor>
      <v-md-editor
        v-else-if="active === 'link'"
        v-model="linkUs"
        mode="preview"
      ></v-md-editor>
      <v-md-editor
        v-else-if="active === 'join'"
        v-model="joinUs"
        mode="preview"
      >
      </v-md-editor>
      <v-md-editor
        v-else-if="active === 'legal'"
        v-model="legal"
        mode="preview"
      >
      </v-md-editor>
      <v-md-editor
        v-else-if="active === 'copyright'"
        v-model="copyright"
        mode="preview"
      >
      </v-md-editor>
      <v-md-editor
        v-else-if="active === 'privacy'"
        v-model="privacy"
        mode="preview"
      >
      </v-md-editor>
      <v-md-editor v-else v-model="scoreRule" mode="preview"> </v-md-editor>
    </a-layout-content>
    <main-footer />
  </a-layout>
</template>
<script>
import MainHeader from "@/components/MainHeader";
import MainFooter from "@/components/MainFooter";
export default {
  components: {
    MainHeader,
    MainFooter,
  },
  data() {
    return {
      aboutUs:
        "# 关于我们 \n Ginkgo Valley 银杏谷，致力于价值信息的传播与交流，力图成为非同质化代币（NFT）领域的资源整合服务商领跑者。\n\n Ginkgo 于2021年初正式成立，创始团队拥有近十年的区块链行业经验，希望通过团队的经验和努力让更广泛的大众看到 、理解NFT的价值 , \n\n 鼓励和引导原创作者依托NFT特点，展现自身的创新活力，实现内容的创作与资产的生成，让大众拥有更多的价值投资（和文化转播）机会，促进信息社会到价值社会的转变。",
      linkUs:
        "# 联系方式 \n \n* 微信公众号：Ginkgo Lab \n* 新浪微博：GinkgoLab \n* 公司邮箱：hello@ginkgonft.com",
      joinUs:
        "# 区块链开发 \n \n* 具有传统互联⽹开发经验 \n* 熟悉互联⽹主流开发语⾔ \n* 熟悉区块链主流技术原理  \n* 拥有区块链项⽬开发经验 \n* 接触区块链2 年以上 \n # 前端开发 \n \n* 拥有⼤型互联⽹前端项⽬开发经验  \n* 熟悉主流前端框架vue 、react   \n* 熟悉javascript开发 \n* 前端开发3年以上经验 \n # 项⽬运营  \n \n* 熟悉区块链、nft ⽣态  \n* 熟悉创业项⽬运作 负责项⽬推⼴、运营  \n* 负责项⽬需求调研、分析⼯作  \n* 接触区块链2 年以上 \n",
      scoreRule:
        "# 积分机制 \n #### 签到 \n* 连续签到7天获500积分,7天之后每天累加积分 \n #### 发布 \n* 发布帖子获得50积分，帖子的点赞评论数有额外积分 \n #### 评论 \n* 评论贴子、研报：10积分（每日上限100）\n #### 论坛吧主 \n* 获得5000积分、设定吧规、管理贴吧、删帖等 \n # 奖励机制  \n #### 青铜 \n* 500积分:免费阅读研报 \n #### 白银 \n* 1500积分:申请吧主权限 \n #### 黄金 \n* 5000积分:普通 ginkgo NFT \n #### 铂金 \n* 20000积分:精品 ginkgo NFT \n #### 钻石 \n* 50000积分:专属 ginkgo NFT",
      legal:
        "\n # 法律声明 \n2021年3月1日更新\n \n在使用Ginkgo（www.ginkgonft.com包括电脑端及移动客户端等）之前，请务必仔细阅读本声明。任何直接或间接（包括但不限于通过站外API接入等其它形式）使用Ginkgo网服务或数据的行为，都将被视作已无条件接受本声明所涉全部内容或服务；若使用人（包括Ginkgo网注册用户）对本声明（包括但不限于知识产权、信息和数据、免责声明）的任何条款有异议，请停止使用Ginkgo所提供的全部内容和服务。\n ## 一、知识产权\n* Ginkgo网注册用户（以下简称“用户”）发布在Ginkgo网的原创文章、评论、图片等内容的知识产权均归用户本人所有。\n* 用户通过转载、复制、截图等方式获取他人内容，并发布在Ginkgo网的，相关内容的知识产权属于内容的权利人，用户不得侵犯他人知识产权及其他合法权利。因用户发布内容引发知识产权纠纷的，用户须自行承担相应后果，若因此造成Ginkgo损失的，Ginkgo有权依照法律规定维护合法权益。\n* Ginkgo网展示的Ginkgo标识、版面设计、排版方式、文本、图片、图形等受著作权法、商标法、专利法及其它法律保护的部分，未经Ginkgo书面同意，不得在任何其他平台发布、使用，或出于发布、使用目的的改编、修改，或用于其他商业及非商业目的。\n* Ginkgo不对用户发布内容的知识产权权属进行保证，并且尊重权利人的知识产权及其他合法权益。若权利人认为Ginkgo网用户发布的内容侵犯自身的知识产权及其他合法权益，可依法向Ginkgo（联系邮箱：hello@ginkgonft.com）发出书面通知，并应提供具有证明效力的证据材料。Ginkgo在书面审核相关材料后，有权根据法律及Ginkgo《社区指导原则》，在不事先通知相应发布用户的情况下自行删除相关内容，并保留相关数据。\n* Ginkgo根据上述第4条删除相关内容的，相应发布用户如存在异议，可依法向Ginkgo发出关于被删除内容不侵权的书面说明，并提供具有证明效力的证据材料。Ginkgo在书面审核后，将根据实际情况依法进行处理。\n* Ginkgo鼓励原创，并尽最大努力为用户自主创作并发布于Ginkgo网的内容提供保护，用户可在发表日记、长评等内容时开启原创内容版权声明。Ginkgo可以在获得用户授权后协助用户进行维权。Ginkgo的维权权利不影响用户另行授权第三方进行维权，Ginkgo将在收到用户通知后，停止维权权利的行使。\n ## 二、信息和数据 \n* 除特别说明或者法律另有规定外（包括但不限于我国著作权法、商标法等知识产权法律以及Ginkgo网《法律声明》中“知识产权”部分对相关权属的规定），Ginkgo网公开的全部信息或数据的其它权益归属于Ginkgo。 Ginkgo网所公开的全部信息或数据包括但不限于：网站架构、程序设计、程序代码、页面设计、图片、图形、文字、音频、视频以及包括但不限于NFT数字艺术品、收藏品等条目信息及其对应评分、评论、评分数量、标记记录、话题内容，小组内容等。\n* 除法律另有规定之外，在未取得Ginkgo书面许可前，任何第三方不得将Ginkgo网的任何公开信息或数据以任何目的进行任何形式的使用，包括但不限于：\n* 商业性使用；\n* 以可能损害Ginkgo利益的方式对Ginkgo网NFT数字艺术品、收藏品等条目信息、评分或评论的使用、引用以及展示；\n* 对Ginkgo网内容的衍生利用，包括但不限于基于或利用Ginkgo网内容而开发的任何插件、软件、应用程序、网站；\n* 第三方以任何形式盗取、拷贝用户账号信息，或采用诱导、要求用户提供账号名称及密码等方式登录用户账号，或对用户主页、ID信息、账号信息的其它使用；或以上述方式取得用户账号登录信息、ID信息、主页信息后，以任何手段复制、转载、抓取Ginkgo网内容；\n* 侵犯或可能侵犯Ginkgo利益的数据采集、网络爬虫或类似的数据收集以及数据摘录等；\n* 在其它网站、应用程序、服务或商品中使用Ginkgo的商标、标识或其他Ginkgo专有信息（包括图像、文字、数字、网页设计或形式）；\n* 其它可能侵犯Ginkgo合法权益的行为。3、如需使用Ginkgo网所公开的信息或数据，请联系Ginkgo（邮箱：hello@ginkgonft.com）并取得相应的授权。对于任何违反上述声明的行为，Ginkgo保留追究其法律责任的权利。\n ## 三、免责声明\n* Ginkgo网注册用户（以下简称“用户”）于Ginkgo网发布的一切内容（包含但不限于通过Ginkgo网目前各产品功能如论坛、博客等形式发布的内容）仅代表用户个人观点，不视为Ginkgo知晓其内容之存在、赞同其内容之观点或证明其内容的真实性。作为内容的发布者，需对所发布内容负责，因所发布内容引发的一切纠纷，由该内容的发布者承担全部法律责任。在法律允许的范围内，Ginkgo对上述内容予以免责。\n* Ginkgo网仅为用户发布的内容提供存储空间，Ginkgo不对Ginkgo网的内容、服务功能、可靠性、可用性做任何承诺。Ginkgo将尽商业上合理水平的技能和注意义务以提供稳定的服务，但不保证存在技术、政策、运营等原因时，Ginkgo网的服务不会中断。因网络状况、通讯线路、第三方网站或管理部门的要求、技术故障等任何原因而导致任何使用人不能正常使用Ginkgo网时，Ginkgo不因此承担责任。\n* 用户在Ginkgo网发布侵犯他人知识产权、名誉权或其他合法权益的内容，或发布损害国家利益、违背现行法律法规及相关政策、违背公序良俗的相关内容时，Ginkgo有权对相应内容采取屏蔽、删除等处理措施，并保留移交司法机关或行政机关处理的权利。Ginkgo对上述内容的具体处理方式以相关账号管理规则为准并以法律要求的义务为限，Ginkgo不因未履行超出法律规定之义务而承担责任。\n* 个人、法人及非法人组织（以下简称“投诉人”）如认为Ginkgo网上存在侵犯自身合法权益的内容，应依照法律规定向Ginkgo发出通知并提供具有法律效力的证明材料。Ginkgo将依照投诉人通知内容以及现行法律规定对涉嫌侵权内容进行处理。Ginkgo依法处理相关内容，即视为履行完毕相关法律义务，不再对涉嫌侵权内容承担任何法律责任。",
      copyright:
        "\n # 版权声明\n ## 总则\n* 用户在接受Ginkgo网服务之前，请务必仔细阅读本条款并同意本声明。\n* 用户直接或通过各类方式（如站外API引用等）间接使用Ginkgo网服务和数据的行为，都将被视作已无条件接受本声明所涉全部内容；若用户对本声明的任何条款有异议，请停止使用Ginkgo网所提供的全部服务。\n ## 声明内容\n* 用户发表在Ginkgo网的原创文章、评论、图片等内容的版权均归用户本人所有。\n* 用户从Ginkgo网或其他网站通过转载、复制、截图等方式获取他人内容，并发布在Ginkgo网的，相关内容的版权属于原作者。用户不得侵犯他人包括版权在内的知识产权及其他权利。因用户发布他人作品引发知识产权或其他法律纠纷的，用户须自行承担一切后果，与Ginkgo网无关。\n* Ginkgo网提供的网络服务中包含的标识、版面设计、排版方式、文本、图片、图形等均受版权、商标及其它法律保护，未经相关权利人（含Ginkgo网及其他原始权利人）同意，上述内容均不得在任何平台被直接或间接发布、使用、出于发布或使用目的的改写或再发行，或被用于其他任何商业目的。\n* Ginkgo网有权但无义务对用户发布的内容进行审核，并有权根据相关证据结合《侵权责任法》、《信息网络传播权保护条例》等法律法规及Ginkgo社区指导原则对侵权信息进行处理。\n* Ginkgo网尊重权利人的知识产权和合法权益。若权利人认为Ginkgo网用户上传的内容侵犯自身版权或其他合法权益，可依法向Ginkgo网帮助邮箱（hello@ginkgonft.com ）发出书面申请。Ginkgo网在书面审核相关齐备材料后，有权在不事先通知相应发布用户的情况下自行删除相关内容，并依法保留相关数据。在Ginkgo网发布内容，即视为用户同意Ginkgo网就前述情况所采取的相应措施，Ginkgo网不因此而承担任何违约、侵权或其他法律责任。\n* Ginkgo网根据上述第5条原因删除相关内容的，相应发布用户如认为投诉不属实，可依法向Ginkgo网帮助邮箱（hello@ginkgonft.com ）发出关于被删除内容不侵犯著作权的书面反申请。反申请发出后，Ginkgo网在书面审核相关齐备材料后，根据实际情况依法进行处理。",
      privacy:
        "\n # 隐私政策 \n2021年3月1日更新\n ## 引言 \n Ginkgo深知个人信息（含个人敏感信息）对你的重要性，并会全力保护你的个人信息安全。我们致力于维持你对我们的信任，恪守以下原则，保护你的个人信息：权责一致原则、目的明确原则、选择同意原则、最小必要原则、公开透明原则、确保安全原则、主体参与原则等。同时，Ginkgo承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护你的个人信息。本隐私政策（以下简称“本政策”）适用于Ginkgo的所有相关产品与/或服务。如Ginkgo及关联公司的产品与/或服务中使用了Ginkgo提供的产品与/或服务但未设立独立的隐私政策的，则本政策同样适用于该产品与/或服务。如Ginkgo及关联公司就其向你提供的产品与/或服务单独设立有隐私政策的，则相应的产品与/或服务适用于相应隐私政策。在使用Ginkgo各项产品与/或服务前，请你务必仔细阅读并透彻理解本政策，并做出你认为适当的选择。一旦你开始使用Ginkgo的各项产品与/或服务，即表示你已充分理解并同意本政策。需要提醒你注意，本隐私政策仅适用于我们所收集的信息，不适用于通过我们的产品与/或服务而接入的第三方产品与/或服务（包括任何第三方网站）收集的信息以及通过在我们产品与/或服务中进行广告服务的其他公司或机构所收集的信息。本政策将帮助你了解以下内容：\n* 我们如何收集和使用你的个人信息\n* 我们如何使用Cookie 和同类技术\n* 我们如何共享、转让、公开披露你的个人信息\n* 我们如何保护你的个人信息\n* 你的权利\n* 关于儿童的个人信息\n* 你的个人信息如何在全球范围转移\n* 本政策如何更新\n* 如何联系我们\n* 争议解决\n ## 相关术语及定义\n* Ginkgo：指Ginkgo网或对Ginkgo网享有所有权或运营权的主体及其关联公司。\n* 个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，包括个人基本资料（姓名、出生日期）、个人身份信息（身份证、军官证、护照、工作证）、个人生物识别信息（个人基因、指纹）、网络身份标识信息（系统账号、IP地址、邮箱地址及前述有关的密码、口令、口令保护答案）、个人健康生理信息、个人教育工作信息（个人职业、职位、工作单位、学历、学位、教育经历）、个人财产信息（银行账号、存款信息、交易和消费记录、财产信息、征信信息）、个人通信信息（通信通讯联系方式、通信记录和内容）、联系人信息（通讯录、好友列表、群列表）、个人上网记录（指通过日志存储的用户操作记录）、个人常用设备记录（包括硬件序列号、设备MAC地址、软件列表、唯一设备识别码）、个人位置信息（包括行踪轨迹、精准定位信息、住宿信息等）其他信息（婚史、宗教信息、性取向、未公开的违法犯罪记录等）。本定义出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》。\n* 个人敏感信息：指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。包括个人财产信息（银行账号、鉴别信息、交易和消费记录、流水记录等）、个人生物识别信息、个人身份信息（如身份证、军官证、护照、工作证）、网络身份标识信息（如系统账号、邮箱地址及前述有关的密码、口令、口令保护答案）、其他信息（个人电话号码、性取向、婚史、行踪轨迹、网页浏览记录、精确定位信息）等，我们将在本隐私政策中对全部个人敏感信息加粗斜体处理。本定义出自于GB/T 35273-2017《信息安全技术 个人信息安全规范》。\n* 收集：指获得对个人信息的控制权的行为，包括由个人信息主体主动提供、通过与个人信息主体交互或记录个人信息主体行为等自动采集，以及通过共享、转让、搜集公开信息间接获取等方式。\n* 删除：指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。\n* 公开披露：指向社会或不特定人群发布信息的行为。\n* 转让：指将个人信息控制权由一个控制者向另一个控制者转移的过程。\n* 共享：指个人信息控制者向其他控制者提供个人信息，且双方分别对个人信息拥有独立控制权的过程。\n* 匿名化：指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。注：个人信息经匿名化处理后所得的信息不属于个人信息。\n* 去标识化：指通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。\n* 关联公司：指相互之间存在关联关系的公司，关联关系是指公司控股股东、实际控制人、董事、监事、高级管理人员与其直接或者间接控制的企业之间的关系，以及可能导致公司利益转移的其他关系。\n ## 一、我们如何收集和使用你的个人信息\n #### 我们如何收集你的个人信息你在使用Ginkgo提供的产品与/或服务时，为了更好地实现你的目的，我们可能收集和使用你的个人信息。包括：\n* 你在注册Ginkgo账号时提供的信息注册并登录Ginkgo账号时，需要你提供手机号码、电子邮箱或第三方账号（微信、QQ、微博 ）的信息，我们将通过发送短信验证码或邮件的方式来验证你的账号是否有效。你可根据自身需求补充填写个人信息（头像、昵称、简介、性别、城市、生日）。\n* 在你使用产品与/或服务的过程中收集的信息使用本隐私政策“（二）我们如何使用你的个人信息”中所列举的Ginkgo产品与/或服务时，我们可能会收集你使用的设备信息（包括操作系统、软件版本、语言设置、IP地址），浏览信息（包括搜索关键词、访问页面链接和访问时间），发表信息（包括文字、图片、视频），位置信息（包括搜索热映电影、同城活动），交易信息（包括交易记录、购买需要邮寄的物品时提供的地址信息），身份信息（包括认证阅读作者、音乐人、创作者时需要提供的身份证号码、手机号码）。\n* 第三方向Ginkgo提供的信息：\n* 你在第三方产品与/或服务中使用Ginkgo的时候，我们会收集第三方产品与/或服务向我们提供的有关信息。\n* 你提供的上述信息，将在你使用本产品与/或服务期间持续授权我们使用。在你注销账号时，我们将停止使用并删除上述信息。\n* 提供上述信息，尤其是个人敏感信息，你可能面临用户信息泄露或用户账号被盗、个人隐私及财产安全难以保障等风险，但我们将尽最大努力避免上述风险发生。\n* 如你选择不提供上述信息，你可能无法注册成为我们的用户或无法享受我们提供的某些产品与/或服务，或者无法达到相关产品与/或服务拟达到的效果。\n #### 我们如何使用你的个人信息我们会在下列情况下使用你的个人信息：\n ##### 向你提供你使用的各项产品与/或服务，并维护、改进这些服务。\n* 发布功能：你可以发布文字、图片、视频，我们需要收集你发布的信息，并展示你的昵称、头像、发布内容。\n* 个性化功能：你可以浏览、关注、收藏你感兴趣的动态、长评、相册、条目，我们需要结合你的操作行为并通过算法分析，向你进行个性化推荐、展示或推送你可能感兴趣的特定信息。有的信息可能不是你喜欢的信息。\n* 搜索功能：你可以使用对关键字进行查询的服务，我们需要使用网络存储机制和应用数据缓存，收集你设备上的信息并进行本地存储，以提供更便捷的搜索服务。\n* 定位功能：你可以使用与地理位置相关的服务，需要收集你的位置信息来提供所在区域的商品或服务。\n* 认证功能：你可以使用身份认证的服务。当你申请“Ginkgo创作者”时，我们需要收集你的姓名、有效身份证件验证身份信息。信息审核通过后，我们会为你的个人账号提供认证标识。\n* 交易功能：你可以开通“赞赏功能”以使用收款服务。当你希望购买商品、线上课程、电子书、专栏，或使用需付费的官方同城服务时，你需要使用“支付功能”。在收付款的过程中，我们需要收集你提供的身份证号码、收款方式、第三方支付账号（包括支付宝账号、Apple Pay 账号或其他形式的银行卡信息）以提供高效的交易服务。\n* 营销活动：你可以参加由我们或第三方举办的线上或线下的营销活动，包括提前观影、线下沙龙、展览、市集，我们会征得你的同意后，收集你的手机号码、用户ID、真实姓名以提供更好的活动体验。\n* 客服功能：你可以向客服发起投诉、申诉或咨询，我们需要你提供真实姓名、手机号码、电子邮件。以及时地向你反馈投诉、申诉或咨询结果，如以个人名义进行投诉，还需要提供身份证件。\n* 经你同意的其他目的，包括但不限于向你发出产品和服务信息，或通过系统向你展示个性化的第三方推广信息，或在征得你同意的情况下与我们的合作伙伴共享信息以便他们向你发送有关其产品和服务的信息。有的信息有可能是你不希望接收的信息。\n ##### 需要提醒你注意，以下情形中，使用你的个人信息无需你的同意：\n* 与个人信息控制者履行法律法规规定的义务相关的；\n* 与国家安全、国防安全直接相关的；\n* 与公共安全、公共卫生、重大公共利益直接相关的；\n* 与刑事侦查、起诉、审判和判决执行等直接相关的；\n* 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；\n* 所收集的个人信息是你自行向社会公众公开的；\n* 从合法公开披露的信息中收集的你的个人信息的，如合法的新闻报道、政府信息公开等渠道；\n* 根据你的要求签订和履行合同所必需的；\n* 用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；\n* 出于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的。\n ## 二、我们如何使用Cookie和同类技术\n #### Cookie使用 \n* Cookie 能帮助你实现你的联机体验的个性化，你可以接受或拒绝 Cookie ，大多数 Web 浏览器会自动接受 Cookie，但你通常可根据自己的需要来修改浏览器的设置以拒绝 Cookie。为了让你在访问Ginkgo时能得到更好的服务，Ginkgo有时会使用 Cookie 以便知道哪些网站受欢迎。Cookie不会跟踪个人信息。当你注册Ginkgo时，Ginkgo亦会使用 Cookie。在这种情况下，Ginkgo会收集并存储有用信息，当你再次访问Ginkgo时，我们可辨认你的身份。来自Ginkgo的 Cookie 只能被Ginkgo读取。如果你的浏览器被设置为拒绝 Cookie，你仍然能够访问Ginkgo的大多数网页。\n #### 网站信标和像素标签 \n* 除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向你发送的电子邮件可能含有链接至我们网站内容的点击 URL。如果你点击该链接，我们则会跟踪此次点击，帮助我们了解你的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果你不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。\n #### Do Not Track(请勿追踪) \n* 很多网络浏览器均设有 Do Not Track 功能，该功能可向网站发布 Do Not Track 请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果你的浏览器启用了 Do Not Track，那么我们的网站都会尊重你的选择。\n ## 三、我们如何共享、转让、公开披露你的个人信息 \n 我们充分知晓因违法共享、转让、公开披露个人信息对个人信息主体造成损害时所应承担的法律责任，对于你的个人信息的一切共享、转让、公开披露，我们将严格按照以下条款进行：\n #### 共享尊重用户个人隐私是Ginkgo的一项基本原则。除以下情形外，我们不会与任何公司、组织和个人分享你的个人信息：\n* 在获取明确同意的情况下共享：获得你的明确同意后，我们会与其他方共享你的个人信息；\n* 我们可能会按照司法机关或行政机关的要求，对外共享你的个人信息；\n* 与我们的关联公司共享：你的个人信息可能会与Ginkgo的关联公司共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求你的授权同意。\n* 与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些产品与/或服务将由授权合作伙伴提供。我们可能会与合作伙伴共享你的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享你的个人信息，并且只会共享提供产品与/或服务所必要的个人信息，并对我们与之共享个人信息的公司、组织和个人签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。\n #### 转让我们不会将你的个人信息转让给任何公司、组织和个人，但以下情况除外：\n* 在获取明确同意的情况下转让：获得你的明确同意后，我们会向其他方转让你的个人信息。\n* 在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有你个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向你征求授权同意。\n #### 公开披露除了因Ginkgo社区维护需要，对违规账号、欺诈、辱骂等严重损害Ginkgo社区的行为进行处罚公告（如公布被处罚账号的主页链接），或者公布中奖/获胜者名单时展示相关信息等必要事宜而进行必要披露之外，我们仅会在获得你明确同意后，公开披露你的个人信息。\n 共享、转让、公开披露个人信息授权同意的例外情形根据法律法规的规定，在下述情况下，共享、转让、公开披露你的个人信息无需事先征得你的授权同意：\n* 与我们履行法律法规规定的义务相关的；\n* 与国家安全、国防安全直接相关的；\n* 与公共安全、公共卫生、重大公共利益直接相关的；\n* 与刑事侦查、起诉、审判和判决执行等直接相关的；\n* 出于维护你或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；\n* 你自行向社会公众公开的个人信息；\n* 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。",
    };
  },
  computed: {
    active() {
      return this.$route.query.active;
    },
  },
};
</script>
